Show / Hide Table of Contents
Class MatPrestressSteelEc2
Material prestressing steel Ec2
Inheritance
System.Object
OpenObject
OpenElementId
Material
MatPrestressSteel
MatPrestressSteelEc2
Inherited Members
 MatPrestressSteel.Diameter
 MatPrestressSteel.Area
 MatPrestressSteel.NumberOfWires
 MatPrestressSteel.EquivalentDiameter
 Material.Name
 Material.LoadFromLibrary
 Material.E
 Material.G
 Material.Poisson
 Material.UnitMass
 Material.SpecificHeat
 Material.ThermalExpansion
 Material.ThermalConductivity
 Material.IsDefaultMaterial
 Material.OrderInCode
 Material.StateOfThermalExpansion
 Material.StateOfThermalConductivity
 Material.StateOfThermalSpecificHeat
 Material.StateOfThermalStressStrain
 Material.StateOfThermalStrain
 Material.UserThermalSpecificHeatCurvature
 Material.UserThermalConductivityCurvature
 Material.UserThermalExpansionCurvature
 Material.UserThermalStrainCurvature
 Material.UserThermalStressStrainCurvature
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Material
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Libraries.Material.ECEN.MatPrestressSteelECEN,CI.Material", "CI.StructModel.Libraries.Material.IMatPrestressSteel,CI.BasicTypes", typeof(MatPrestressSteel))]
public class MatPrestressSteelEc2 : MatPrestressSteel
Constructors
Improve this Doc   View Source
MatPrestressSteelEc2()
Constructor
Declaration
public MatPrestressSteelEc2()
Properties
Improve this Doc   View Source
Agt
Total elongation at max. force (prEN 10138)
Declaration
public double Agt { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
DiagramType
Type of diagram
Declaration
public ReinfDiagramType DiagramType { get; set; }
Property Value
 Type |  Description
 ReinfDiagramType
Improve this Doc   View Source
Epsuk
Characteristic strain at maximum load (EN 1992-1-1)
Declaration
public double Epsuk { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Fm
Char. value of max. force (prEN 10138)
Declaration
public double Fm { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Fp01
Char. 0.1% proof force
Declaration
public double Fp01 { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Fp01k
0,1% proof-stress (EN 1992-1-1)
Declaration
public double Fp01k { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Fpk
Characteristic tensile strength (EN 1992-1-1)
Declaration
public double Fpk { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Fr
Fatigue stress range (prEN 10138)
Declaration
public double Fr { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Production
Production type
Declaration
public ProductionType Production { get; set; }
Property Value
 Type |  Description
 ProductionType
Improve this Doc   View Source
SurfaceCharacteristic
Surface characteristic
Declaration
public SurfaceCharacteristicType SurfaceCharacteristic { get; set; }
Property Value
 Type |  Description
 SurfaceCharacteristicType
Improve this Doc   View Source
Type
Type of prestress steel
Declaration
public PrestressSteelType Type { get; set; }
Property Value
 Type |  Description
 PrestressSteelType
 Improve this Doc
 View Source